'''
크기가 다른 원반 n개를 출발점 기둥에서 도착점 기둥으로 전부 옮겨야 합니다.
원반은 한 번에 한 개씩만 옮길 수 있습니다.
원반을 옮길 때는 한 기둥의 맨위 원반을 뽑아, 다른 기둥의 맨 위로만 옮길 수 있습니다.
원반을 옮기는 과정에서 큰 원반을 작은 원반 위로 올릴 수 없습니다.
'''
# 하노이의 탑 알고리즘
# 원반이 한개면 그냥 옮기면 끝

# 원반이 n개 일때:
#     1번 기둥에 있는 n개 원반 중 n-1개를 2번 기둥으로 옮깁니다.(3번 기둥 보조 기둥으로 씀)
#     1번 기둥에 남아 있는 가장 큰 원반을 3번 기둥으로 옮깁니다.
#     2번 기둥에 있는 n-1개 원반을 다시 3번 기둥으로 옮깁니다(1번 기둥을 보조기둥으로 씀)

# 하노이의 탑 변수
# 입력: 옮기려는 원반의 수 n
#      옮길 원반이 현재 있는 출발점 기둥 from_pos
#      원반을 옮길 도착점 기둥 to_pos
#      옮기는 과정에서 사용할 보조 기둥 aux_pos
# 출력 : 원반을 옮기는 순서

def hanoi(n, from_pos, to_pos, aux_pos):
    if n == 1: # 원반 한 개를 옮기는 문제면 그냥 옮기면 됨
        print(from_pos, '->', to_pos)
        return

    hanoi(n - 1, from_pos, aux_pos, to_pos)
    print(from_pos, '->', to_pos)
    hanoi(n - 1, aux_pos, to_pos, from_pos)

print("n = 1")
hanoi(1, 1, 3, 2)
print("n = 2")
hanoi(2, 1, 3, 2)
print("n = 3")
hanoi(3, 1, 3, 2)