# 큐와 스택

# -큐-
# 큐는 '줄 서기'에 비유할 수 있습니다. 택시를 타기 위해서 줄을 서는 과정을 떠올려보자
# 새로 택시 정류장에 도착한 사람은 맨 뒤로 가서 줄을 서고, 택시가 도착하면 그 줄의 맨 앞에 선 사람이 줄을 빠져나가 택시를 탑니다.
# 가장 먼저 줄을 선 사람이 가장 먼저 택시를 타게 됩니다.
# 큐에 자료를 한 개 집어넣는 동작을 '인큐(enqueue)',
# 큐 안에 있는 자료를 한 개 꺼내는 동작을 '디큐(dequeue)'라고 표현합니다.
# First In First Out

# -스택-
# 스택은 '접시쌓기' 에 비유할 수 있습니다. 식당에서 접시를 차곡차곡 쌓았다가 하나씩 꺼내 설거지 하는 과정을 생각해봅시다
# 다 먹은 접시를 쌓을 때는 쌓은 접시 맨 위에 올려놓습니다. 설거지하려고 접시를 꺼낼 때도 맨 위에 있는 접시부터 꺼냅니다.
# 바꿔 말하면 가장 마지막에 들어간 자료를 가장 먼저 꺼내는 것을 의미합니다.
# 스택에 자료를 하나 집어넣는 동작을 '푸시(push)',
# 스택 안에 있는 자료를 하나 꺼내는 동작을 '팝(pop)' 이라고 표현합니다.
# Last In First Out